IRP/src/Documents/OutgoingMessage/OutgoingMessage.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>OutgoingMessage</name>
  <posting>Deny</posting>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>MessageType</name>
    <type>
      <types>EnumRef.MessageTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>MailAccount</name>
    <type>
      <types>CatalogRef.IntegrationSettings</types>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LetterRecipientsString</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextLetterHTML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>LetterMultimedia</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Importance</name>
    <type>
      <types>EnumRef.MessagesImportance</types>
    </type>
  </attributes>
  <attributes>
    <name>LetterSize</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HasAttachments</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NotifyDelivery</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NotifyReading</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>LetterRecipients</name>
    <attributes>
      <name>Addressee</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Destination</name>
      <type>
        <types>CatalogRef.Partners</types>
        <types>CatalogRef.Companies</types>
        <types>CatalogRef.RetailCustomers</types>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>IsCopy</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsBlind</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Attachments</name>
    <attributes>
      <name>File</name>
      <type>
        <types>CatalogRef.Files</types>
      </type>
    </attributes>
    <attributes>
      <name>PresentationInLetter</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/InformationRegisters/MessagesQueueToSend/MessagesQueueToSend.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>MessagesQueueToSend</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Sent</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DateSent</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>NumberAttempts</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>LastWarning</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Message</name>
    <type>
      <types>DocumentRef.OutgoingMessage</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/Documents/OutgoingMessage/Forms/DocumentForm/Module.bsl
// @strict-types

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Object.Ref.IsEmpty() Then
		MailAccountValues = UserSettingsServer.GetUserSettings(
			SessionParameters.CurrentUser, 
			New Structure("MetadataObject, AttributeName",
				"Document.OutgoingMessage", "MailAccount")); // Array
		If MailAccountValues.Count() > 0 Then
			//@skip-check statement-type-change, property-return-type
			Object.MailAccount = MailAccountValues[0].Value;
		EndIf;
	EndIf;
	
	ReadingFormData();
	TuningForm();
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	SavingFormData(CurrentObject);
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	ReadingFormData();
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "Sended" and Parameter = Object.Ref Then
		SetReadOnly();
	EndIf;
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure DescriptionClick(Item, StandardProcessing)
	CommonFormActions.EditMultilineText(ThisObject, Item, StandardProcessing);
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure AddCopyRecipients(Command)
	Items.AddCopyRecipients.Visible = False;
	Items.CopyRecipients.Visible = True;
EndProcedure

&AtClient
Procedure AddBlindCopyRecipients(Command)
	Items.AddBlindCopyRecipients.Visible = False;
	Items.BlindCopyRecipients.Visible = True;
EndProcedure

&AtClient
Procedure OpenFile(Command)
	
	If Items.Attachments.CurrentData = Undefined Then
		Return;
	EndIf;

	FileRef = Items.Attachments.CurrentData.File;
	FileParameters = GetFileParameters(FileRef);
	URL = PictureViewerClient.GetPictureURL(FileParameters);
	
	Dialog = New GetFilesDialogParameters();
	GetFileFromServerAsync(URL, FileParameters.Description, Dialog);			

EndProcedure

&AtClient
Procedure EditHTML(Command)
	
	TextHTML = "";
	AttachmentsHTML = New Structure;
	//@skip-check invocation-parameter-type-intersect
	TextLetter.GetHTML(TextHTML, AttachmentsHTML);
	
	Items.GroupOfMailPages.CurrentPage = Items.PageTextHTML;

EndProcedure

&AtClient
Procedure SaveHTML(Command)
	
	ReadLetterFromHTML(TextHTML);
	
	Items.GroupOfMailPages.CurrentPage = Items.PageDocHTML;

EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure ReadingFormData()

	LoadAddresses(Recipients, False, False);
	LoadAddresses(CopyRecipients, True, False);
	LoadAddresses(BlindCopyRecipients, True, True);
	
	NewHTML = "";
	AttachmentsHTML = New Structure;
	If ValueIsFilled(Object.Ref) Then
		SavedHTML = Object.Ref.TextLetterHTML.Get();
		If TypeOf(SavedHTML) = Type("String") Then
			NewHTML = SavedHTML;
		EndIf;
		
		SavedAttachments = Object.Ref.LetterMultimedia.Get();
		If TypeOf(SavedAttachments) = Type("Structure") Then
			AttachmentsHTML = SavedAttachments;
		EndIf;
	EndIf;
	ReadLetterFromHTML(NewHTML);

EndProcedure

&AtServer
Procedure ReadLetterFromHTML(NewHTML)
	//@skip-check invocation-parameter-type-intersect
	TextLetter.SetHTML(NewHTML, AttachmentsHTML);
EndProcedure

&AtServer
Procedure SavingFormData(CurrentObject)

	SaveAddresses(Recipients, CurrentObject, False, False);
	SaveAddresses(CopyRecipients, CurrentObject, True, False);
	SaveAddresses(BlindCopyRecipients, CurrentObject, True, True);

	NewHTML = "";
	AttachmentsHTML = New Structure;
	//@skip-check invocation-parameter-type-intersect
	TextLetter.GetHTML(NewHTML, AttachmentsHTML);
	
	CurrentObject.TextLetterHTML = New ValueStorage(NewHTML);
	CurrentObject.LetterMultimedia = New ValueStorage(AttachmentsHTML);
	
EndProcedure

&AtServer
Procedure TuningForm()

	If CopyRecipients.Count() > 0 Then
		Items.AddCopyRecipients.Visible = False;
		Items.CopyRecipients.Visible = True;
	EndIf;
	
	If BlindCopyRecipients.Count() > 0 Then
		Items.AddBlindCopyRecipients.Visible = False;
		Items.BlindCopyRecipients.Visible = True;
	EndIf;
	
	Query = New Query;
	Query.SetParameter("Message", Object.Ref);
	Query.Text =
	"SELECT Message
	|	FROM InformationRegister.MessagesQueueToSend
	|	WHERE Message = &Message";
	QuerySelect = Query.Execute().Select();
	If QuerySelect.Next() Then
		SetReadOnly();
	EndIf;
	
EndProcedure

&AtServer
Procedure SetReadOnly()
	
	ThisForm.ReadOnly = True;
	
	Items.Recipients.ReadOnly = True;
	Items.CopyRecipients.ReadOnly = True;
	Items.BlindCopyRecipients.ReadOnly = True;
	Items.TextLetter.ReadOnly = True;
	
	Items.AddCopyRecipients.Enabled = False;
	Items.AddBlindCopyRecipients.Enabled = False;
	
EndProcedure

&AtServer
//@skip-check typed-value-adding-to-untyped-collection
Procedure LoadAddresses(AddressesList, isCopy, isBlind)
	AddressesList.Clear();
	
	AddressesRecords = Object.LetterRecipients.FindRows(New Structure("isCopy, isBlind", isCopy, isBlind));
	For Each AddresseItem In AddressesRecords Do
		NewRecord = AddressesList.Add(AddresseItem.Addressee);
		If ValueIsFilled(AddresseItem.Destination) Then
			NewRecord.Presentation = String(AddresseItem.Destination);
		EndIf;
	EndDo;
EndProcedure

&AtServer
Procedure SaveAddresses(AddressesList, CurrentObject, isCopy, isBlind)
	
	ToDeleting = New Array;
	AddressesRecords = CurrentObject.LetterRecipients.FindRows(New Structure("isCopy, isBlind", isCopy, isBlind));
	For Each AddressItem In AddressesRecords Do
		If AddressesList.FindByValue(AddressItem) = Undefined Then
			//@skip-check typed-value-adding-to-untyped-collection
			ToDeleting.Add(AddressItem);
		Else
			AddressesList.FindByValue(AddressItem).Check = True;
		EndIf;
	EndDo;
	For Each AddressItem In ToDeleting Do
		//@skip-check invocation-parameter-type-intersect
		CurrentObject.LetterRecipients.Delete(AddressItem);
	EndDo;
	
	For Each ListItem In AddressesList Do
		If Not ListItem.Check And ValueIsFilled(ListItem.Value) Then
			AddressItem = CurrentObject.LetterRecipients.Add();
			AddressItem.Addressee = TrimAll(String(ListItem.Value));
			AddressItem.IsCopy = isCopy;
			AddressItem.isBlind = isBlind;
		EndIf;
	EndDo;
	
EndProcedure

&AtServerNoContext
Function GetFileParameters(FileRef)
	Return PictureViewerServer.CreatePictureParameters(FileRef);
EndFunction

#EndRegion
